bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
/**
 * @file garuda_service.c
 *
 * @brief ESC state machine and ADC ISR.
 *
 * State machine (driven from ADC ISR at PWM rate):
 *   IDLE → ARMED (throttle=0 for 500ms) → ALIGN → OL_RAMP
 *   → (Phase 2: CLOSED_LOOP)
 *
 * Timer1 ISR: 100us tick for heartbeat, board service, and commutation timing.
 *
 * Component: GARUDA SERVICE
 */

#include <xc.h>
#include <stdint.h>
#include <stdbool.h>

#include "garuda_service.h"
#include "garuda_types.h"
#include "garuda_config.h"
#include "garuda_calc_params.h"
#include "hal/hal_adc.h"
#include "hal/hal_pwm.h"
#include "hal/board_service.h"
#include "hal/port_config.h"
#include "motor/commutation.h"
#include "motor/startup.h"
#if FEATURE_BEMF_CLOSED_LOOP
#include "motor/bemf_zc.h"
#endif
#if FEATURE_ADC_CMP_ZC
#include "motor/hwzc.h"
#include "hal/hal_timer.h"
#endif

#if FEATURE_LEARN_MODULES
#include "learn/learn_service.h"
#endif

#if (FEATURE_RX_PWM || FEATURE_RX_DSHOT || FEATURE_RX_AUTO)
#include "input/rx_decode.h"
#endif

#if FEATURE_FOC
#include <math.h>
#include "garuda_foc_params.h"
#include "foc/foc_types.h"
#include "foc/clarke.h"
#include "foc/park.h"
#include "foc/svpwm.h"
#include "foc/pi_controller.h"
#include "foc/back_emf_obs.h"
#include "foc/pll_estimator.h"
#include "foc/flux_estimator.h"
#if FEATURE_SMO
#include "foc/smo_observer.h"
#endif
#if FEATURE_MXLEMMING
#include "foc/mxlemming_obs.h"
#endif
#endif

#if FEATURE_FOC_V2
#include <math.h>
#include "garuda_foc_params.h"
#include "foc/foc_v2_types.h"
#include "foc/foc_v2_control.h"
#include "foc/foc_v2_detect.h"
#include "hal/hal_pwm.h"
#if FEATURE_GSP
#include "gsp/gsp_params.h"
#endif
#endif

#if FEATURE_FOC_V3
#include <math.h>
#include "garuda_foc_params.h"
#include "foc/foc_v3_types.h"
#include "foc/foc_v3_control.h"
#include "hal/hal_pwm.h"
#if FEATURE_GSP
#include "gsp/gsp_params.h"
#endif
#endif

#if FEATURE_BURST_SCOPE
#include "scope/scope_burst.h"
#endif

#include "x2cscope/diagnostics.h"

/* Global ESC runtime data — volatile: shared between ISRs and main loop */
volatile GARUDA_DATA_T garudaData;

#if FEATURE_FOC_V2
/* FOC v2 state — accessed only from ADC ISR (not volatile) */
static FOC_State_t s_foc_v2;
/* Flag: set by profile load handler, checked by ISR to re-init FOC */
volatile bool gspFocReinitNeeded;
#elif FEATURE_FOC_V3
/* FOC v3 state — SMO observer, accessed only from ADC ISR */
static V3_State_t s_foc_v3;
volatile bool gspFocReinitNeeded;
#endif

#if FEATURE_FOC_V2 || FEATURE_FOC_V3
/** Build FOC_MotorParams_t from GSP runtime params (or compile-time fallback). */
static FOC_MotorParams_t BuildFocMotorParams(void)
{
    FOC_MotorParams_t mp;
#if FEATURE_GSP
    mp.Rs             = (float)gspParams.focRsMilliOhm * 0.001f;
    mp.Ls             = (float)gspParams.focLsMicroH * 1e-6f;
    mp.Ke             = (float)gspParams.focKeUvSRad * 1e-6f;
    mp.lambda_pm      = mp.Ke;  /* Ke = lambda_pm for PMSM */
    mp.pole_pairs     = gspParams.motorPolePairs;
    mp.vbus_nom_v     = (float)gspParams.focVbusNomCentiV * 0.01f;
    mp.max_current_a  = (float)gspParams.focMaxCurrentCentiA * 0.01f;
    mp.max_elec_rad_s = (float)gspParams.focMaxElecRadS;
    mp.kp_dq          = (float)gspParams.focKpDqMilli * 0.001f;
    mp.ki_dq          = (float)gspParams.focKiDq;
    mp.obs_lpf_alpha  = (float)gspParams.focObsLpfAlphaMilli * 0.001f;
    mp.align_iq_a     = (float)gspParams.focAlignIqCentiA * 0.01f;
    mp.ramp_iq_a      = (float)gspParams.focRampIqCentiA * 0.01f;
    mp.align_ticks    = (uint32_t)gspParams.focAlignTimeMs * 24U;  /* ms → 24kHz ticks */
    mp.iq_ramp_ticks  = (uint32_t)gspParams.focIqRampTimeMs * 24U;
    mp.ramp_rate_rps2 = (float)gspParams.focRampRateRps2;
    mp.handoff_rad_s  = (float)gspParams.focHandoffRadS;
    mp.fault_oc_a     = (float)gspParams.focFaultOcCentiA * 0.01f;
    mp.fault_stall_rad_s = (float)gspParams.focFaultStallDeciRadS * 0.1f;
#else
    mp.Rs             = MOTOR_RS_OHM;
    mp.Ls             = MOTOR_LS_H;
    mp.lambda_pm      = MOTOR_FLUX_LINKAGE;
    mp.Ke             = MOTOR_KE_VPEAK;
    mp.pole_pairs     = MOTOR_POLE_PAIRS_FOC;
    mp.max_current_a  = MOTOR_MAX_CURRENT_A;
    mp.max_elec_rad_s = MOTOR_MAX_ELEC_RAD_S;
    mp.vbus_nom_v     = MOTOR_VBUS_NOM_V;
    mp.kp_dq          = KP_DQ;
    mp.ki_dq          = KI_DQ;
    mp.obs_lpf_alpha  = OBS_LPF_ALPHA;
    mp.align_iq_a     = STARTUP_ALIGN_IQ_A;
    mp.ramp_iq_a      = STARTUP_RAMP_IQ_A;
    mp.align_ticks    = STARTUP_ALIGN_TICKS;
    mp.iq_ramp_ticks  = STARTUP_IQ_RAMP_TICKS;
    mp.ramp_rate_rps2 = STARTUP_RAMP_RATE_RPS2;
    mp.handoff_rad_s  = STARTUP_HANDOFF_RAD_S;
    mp.fault_oc_a     = FAULT_OC_A;
    mp.fault_stall_rad_s = FAULT_STALL_RAD_S;
#endif
    return mp;
}
#endif

#if FEATURE_FOC
/* ── Module-level FOC state (accessed only from ADC ISR) ─────────────── */
static PI_t         s_pid_d;        /* D-axis current PI */
static PI_t         s_pid_q;        /* Q-axis current PI */
static PI_t         s_pid_spd;      /* Speed PI (outer loop) */
static BackEMFObs_t s_obs;          /* Back-EMF voltage-model observer */
static PLL_t        s_pll;          /* PLL angle/speed estimator */
static FluxEst_t    s_flux_est;     /* Flux-integration angle estimator (parallel) */
#if FEATURE_SMO
static SMO_t        s_smo;          /* Sliding Mode Observer (parallel) */
static PLL_t        s_pll_smo;      /* PLL driven by SMO back-EMF estimates */
#endif
#if FEATURE_MXLEMMING
static MxlObs_t     s_mxl;          /* MXLEMMING flux observer */
#endif

static float        s_iq_ref;       /* Q-axis current reference (A) */
static float        s_vbus;         /* Last measured bus voltage (V) */
static uint16_t     s_slow_ctr;     /* Slow loop counter (0 -> FOC_SLOW_DIV) */

/* Open-loop startup ramp state */
static float        s_theta_ol;     /* Open-loop angle (rad) */
static float        s_omega_ol;     /* Open-loop speed (rad/s elec.) */
static bool         s_ovr_released; /* True after overrides released this run */
static uint32_t     s_iq_ramp_ctr;  /* Ticks elapsed since entry (Iq ramp) */
static uint32_t     s_align_ctr;    /* Ticks elapsed during alignment dwell */

