bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
/* PLL angle correction gain (per fast-loop tick): 2pi x BW x Ts */
#define PLL_CORRECTION_GAIN  (6.28318530718f * PLL_CORRECTION_BW_HZ * FOC_TS_FAST_S)

/* ADC zero-current offset calibration (sampled while motor is off) */
#define CAL_SAMPLES  1024U
#define CAL_SHIFT    10U
static uint32_t     s_ia_accum;
static uint32_t     s_ib_accum;
static uint16_t     s_cal_count;
static uint16_t     s_ia_offset;
static uint16_t     s_ib_offset;
static bool         s_cal_done;

/* Stall timer (slow loop ticks) */
static uint32_t     s_stall_ctr;

/* I/f → closed-loop transition state */
static bool         s_cl_active;    /* True after PLL lock → speed PI + PLL angle */
static uint32_t     s_cl_lock_ctr;  /* Consecutive ticks PLL tracks OL within tolerance */

/* Phase current OC debounce (software OC since ibusRaw=0 at PWM valley) */
#define FOC_OC_DEBOUNCE  48U  /* 48 ticks @ 24kHz = 2ms */
static uint16_t     s_foc_oc_ctr;

/* Helper: get PLL rotor angle (corrected for BEMF->rotor offset) */
static inline float pll_rotor_angle(void)
{
    float a = s_pll.theta_est - PLL_ANGLE_OFFSET;
    if (a < 0.0f)            a += 6.28318530718f;
    if (a >= 6.28318530718f) a -= 6.28318530718f;
    return a;
}

#if FEATURE_SMO
static inline float smo_rotor_angle(void)
{
    float a = s_pll_smo.theta_est - PLL_ANGLE_OFFSET;
    if (a < 0.0f)            a += 6.28318530718f;
    if (a >= 6.28318530718f) a -= 6.28318530718f;
    return a;
}
#endif

/* Forward declarations */
static void foc_startup_reset(void);

static void foc_startup_reset(void)
{
    s_theta_ol     = 0.0f;
    s_omega_ol     = 0.0f;
    s_ovr_released = false;
    s_iq_ramp_ctr  = 0;
    s_align_ctr    = 0;
    s_cl_active    = false;
    s_cl_lock_ctr  = 0;
    s_foc_oc_ctr   = 0;
    pi_reset(&s_pid_d);
    pi_reset(&s_pid_q);
    pi_reset(&s_pid_spd);
    s_iq_ref    = 0.0f;
    s_stall_ctr = 0;
    flux_est_reset(&s_flux_est);
#if FEATURE_SMO
    smo_reset(&s_smo);
    pll_reset(&s_pll_smo);
#endif
#if FEATURE_MXLEMMING
    mxl_reset(&s_mxl);
#endif
}

static inline float counts_to_amps_cal(uint16_t raw, uint16_t offset)
{
    /* Negate: OA1/OA2 inverting topology on MCLV-48V-300W DIM.
     * AN1292 reference uses (HALF_ADC_COUNT - ADC_DATA) for same reason. */
    return -((float)(int16_t)(raw - offset)) * CURRENT_SCALE_A_PER_COUNT;
}

static inline float counts_to_vbus(uint16_t raw)
{
    return (float)raw * VBUS_SCALE_V_PER_COUNT;
}
#endif /* FEATURE_FOC */

#if FEATURE_FOC_V2 || FEATURE_FOC_V3
/* Reuse same helper for v2/v3 telemetry raw→amps conversion */
static inline float v2_counts_to_amps(uint16_t raw, uint16_t offset)
{
    return -((float)(int16_t)(raw - offset)) * CURRENT_SCALE_A_PER_COUNT;
}
#endif

/* Heartbeat LED counter */
static uint16_t heartbeatCounter = 0;
/* Sub-counter for 1ms system tick from 100us Timer1 */
static uint8_t msSubCounter = 0;

#if FEATURE_BEMF_CLOSED_LOOP
/* File-scope statics for ZC — only accessed from ADC ISR, NOT Timer1 ISR */
static uint16_t adcIsrTick = 0;
static ESC_STATE_T prevAdcState = ESC_IDLE;

#if FEATURE_SINE_STARTUP
/* Helper macro: write trap duties for active/float/low phases.
 * Uses virtual neutral (midpoint of active and low) for float phase. */
#define MORPH_WRITE_TRAP_DUTIES(step, activeDuty) do { \
    uint32_t _tf = ((activeDuty) + MIN_DUTY) / 2; \
    const COMMUTATION_STEP_T *_s = &commutationTable[(step)]; \
    uint32_t _dA = (_s->phaseA == PHASE_PWM_ACTIVE) ? (activeDuty) : \
                   (_s->phaseA == PHASE_FLOAT) ? _tf : MIN_DUTY; \
    uint32_t _dB = (_s->phaseB == PHASE_PWM_ACTIVE) ? (activeDuty) : \
                   (_s->phaseB == PHASE_FLOAT) ? _tf : MIN_DUTY; \
    uint32_t _dC = (_s->phaseC == PHASE_PWM_ACTIVE) ? (activeDuty) : \
                   (_s->phaseC == PHASE_FLOAT) ? _tf : MIN_DUTY; \
    HAL_PWM_SetDutyCycle3Phase(_dA, _dB, _dC); \
} while(0)
#endif
#endif

/**
 * @brief Initialize ESC service data to safe defaults.
 */
void GARUDA_ServiceInit(void)
{
    garudaData.state = ESC_IDLE;
    garudaData.throttle = 0;
    garudaData.currentStep = 0;
    garudaData.direction = DIRECTION_DEFAULT;
    garudaData.duty = 0;
    garudaData.vbusRaw = 0;
    garudaData.potRaw = 0;
    garudaData.faultCode = FAULT_NONE;
    garudaData.alignCounter = 0;
    garudaData.rampStepPeriod = RT_INITIAL_STEP_PERIOD;
    garudaData.rampCounter = 0;
    garudaData.systemTick = 0;
    garudaData.armCounter = 0;
    garudaData.runCommandActive = false;
    garudaData.desyncRestartAttempts = 0;
    garudaData.recoveryCounter = 0;

#if FEATURE_FOC
    /* FOC algorithm state */
    pi_init(&s_pid_d,   KP_DQ,  KI_DQ,  -CLAMP_VDQ,       CLAMP_VDQ);
    pi_init(&s_pid_q,   KP_DQ,  KI_DQ,  -CLAMP_VDQ,       CLAMP_VDQ);
    pi_init(&s_pid_spd, KP_SPD, KI_SPD, -CLAMP_IQ_REF_A,  CLAMP_IQ_REF_A);
    bemf_obs_reset(&s_obs);
    pll_reset(&s_pll);
    flux_est_reset(&s_flux_est);
#if FEATURE_SMO
    smo_reset(&s_smo);
    pll_reset(&s_pll_smo);
#endif
#if FEATURE_MXLEMMING
    mxl_reset(&s_mxl);
#endif
    foc_startup_reset();
    s_iq_ref    = 0.0f;
    s_vbus      = MOTOR_VBUS_NOM_V;
    s_slow_ctr  = 0;
    s_stall_ctr = 0;
    s_ia_accum  = 0;
    s_ib_accum  = 0;
    s_cal_count = 0;
    s_ia_offset = ADC_MIDPOINT;
    s_ib_offset = ADC_MIDPOINT;
    s_cal_done  = false;
#endif

#if FEATURE_FOC_V2
    {
        FOC_MotorParams_t mp = BuildFocMotorParams();
        foc_v2_init(&s_foc_v2, &mp);
        gspFocReinitNeeded = false;
    }
#elif FEATURE_FOC_V3
    {
        FOC_MotorParams_t mp = BuildFocMotorParams();
        foc_v3_init(&s_foc_v3, &mp);
        gspFocReinitNeeded = false;
    }
#endif

    /* Throttle source init — unconditional (Finding 42/54).
     * Priority: ADC_POT > RX_AUTO > RX_PWM > RX_DSHOT > GSP */
#if FEATURE_ADC_POT
    garudaData.throttleSource = THROTTLE_SRC_ADC;
#elif FEATURE_RX_AUTO
    garudaData.throttleSource = THROTTLE_SRC_AUTO;
#elif FEATURE_RX_PWM
    garudaData.throttleSource = THROTTLE_SRC_PWM;
#elif FEATURE_RX_DSHOT
    garudaData.throttleSource = THROTTLE_SRC_DSHOT;
#elif FEATURE_GSP
    garudaData.throttleSource = THROTTLE_SRC_GSP;
#endif

