bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
            if (garudaData.vbusRaw < uvThreshold)
            {
                if (++vbusUvCount >= VBUS_FAULT_FILTER)
                {
#if FEATURE_ADC_CMP_ZC
                    if (garudaData.hwzc.enabled)
                        HWZC_Disable(&garudaData);
                    garudaData.hwzc.fallbackPending = false;
#endif
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                    HAL_MC1PWMDisableOutputs();
                    garudaData.state = ESC_FAULT;
                    garudaData.faultCode = FAULT_UNDERVOLTAGE;
                    garudaData.runCommandActive = false;
                    LED2 = 0;
                }
            }
            else { vbusUvCount = 0; }
            } /* uvThreshold scope */
        }
        else
        {
            vbusOvCount = 0;
            vbusUvCount = 0;
        }
    }
#endif

    /* Bus current sensing and overcurrent protection */
#if FEATURE_HW_OVERCURRENT
    /* Read AD1CH2DATA — clears data-ready (mandatory on dsPIC33AK) */
    garudaData.ibusRaw = ADCBUF_IBUS;

    /* Track peak for diagnostics */
    if (garudaData.ibusRaw > garudaData.ibusMax)
        garudaData.ibusMax = garudaData.ibusRaw;

    /* Count CLPCI activity via CLEVT latched event flags.
     * Poll all 3 generators — active PWM phase rotates with commutation.
     * Coarse counter: one 41.7us ADC tick may collapse multiple chop events. */
#if (OC_PROTECT_MODE == 0 || OC_PROTECT_MODE == 2) && OC_CLPCI_ENABLE
    if (PCI_CLIMIT_EVT_PG1 || PCI_CLIMIT_EVT_PG2 || PCI_CLIMIT_EVT_PG3)
    {
        garudaData.clpciTripCount++;
        /* Clear W1C event flags via direct register write (not bitfield RMW)
         * to avoid accidentally clearing other W1C bits in PGxSTAT. */
        PG1STAT = PCI_CLIMIT_EVT_MASK;
        PG2STAT = PCI_CLIMIT_EVT_MASK;
        PG3STAT = PCI_CLIMIT_EVT_MASK;
    }
#endif

#ifdef ENABLE_PWM_FAULT_PCI
    /* Count transient FPCI trips via FLTEVT latched event flags.
     * With TERM=1 (auto-terminate), board FPCI trips that resolve within
     * one PWM cycle never set FLTACT by the time the ISR runs — but
     * FLTEVT latches the event. Non-zero count = duty being chopped. */
    if (PCI_FAULT_EVT_PG1 || PCI_FAULT_EVT_PG2 || PCI_FAULT_EVT_PG3)
    {
        garudaData.fpciTripCount++;
        PG1STAT = PCI_FAULT_EVT_MASK;
        PG2STAT = PCI_FAULT_EVT_MASK;
        PG3STAT = PCI_FAULT_EVT_MASK;
    }
#endif

    /* Software hard fault — immediate shutdown (Mode 2 only) */
#if OC_PROTECT_MODE == 2
    if (garudaData.ibusRaw > OC_FAULT_ADC_VAL
        && garudaData.state >= ESC_ALIGN
        && garudaData.state <= ESC_CLOSED_LOOP)
    {
#if FEATURE_ADC_CMP_ZC
        if (garudaData.hwzc.enabled)
            HWZC_Disable(&garudaData);
        garudaData.hwzc.fallbackPending = false;
#endif
        HAL_MC1PWMDisableOutputs();
        garudaData.state = ESC_FAULT;
        garudaData.faultCode = FAULT_OVERCURRENT;
        garudaData.runCommandActive = false;
        LED2 = 0;
    }
#endif
#endif /* FEATURE_HW_OVERCURRENT */

#if FEATURE_FOC
    /* ── FOC control path — replaces ENTIRE 6-step state machine ──
     * Architecture from RK1 (proven on A2212 1400KV):
     *   - Inline modular calls (no MCAPP_FOCStateMachine black box)
     *   - V/f voltage-mode with gradual PLL angle correction
     *   - POT=0 → motor coasts to stop; POT>0 → resumes (no re-arm)
     *   - No ESC_RUNNING state — PLL correction makes CL implicit
     */
    {
        /* Convert ADC counts → physical units using calibrated offsets */
        float ia    = counts_to_amps_cal(raw_ia, s_ia_offset);
        float ib    = counts_to_amps_cal(raw_ib, s_ib_offset);
        s_vbus      = counts_to_vbus(garudaData.vbusRaw);

        /* Dynamic PI voltage clamp — must match circular limiter (Vbus/sqrt(3))
         * so anti-windup engages at the real output ceiling, not 1.73x above it. */
        {
            float vclamp = s_vbus * 0.95f * 0.577350269f;
            s_pid_d.out_max =  vclamp;
            s_pid_d.out_min = -vclamp;
            s_pid_q.out_max =  vclamp;
            s_pid_q.out_min = -vclamp;
        }

        /* Throttle source: use garudaData.throttle (already muxed above) */
        uint16_t throttle_raw = garudaData.throttle;

        /* State dispatch */
        ESC_STATE_T state = garudaData.state;

        if (state == ESC_IDLE || state == ESC_ARMED)
        {
            /* Outputs off — PWM overrides already asserted */
            s_ovr_released = false;

            /* ADC zero-current offset calibration (motor off → no current) */
            if (!s_cal_done) {
                s_ia_accum += raw_ia;
                s_ib_accum += raw_ib;
                if (++s_cal_count >= CAL_SAMPLES) {
                    s_ia_offset = (uint16_t)(s_ia_accum >> CAL_SHIFT);
                    s_ib_offset = (uint16_t)(s_ib_accum >> CAL_SHIFT);
                    s_cal_done  = true;
                }
            }

            goto foc_slow_loop;
        }
        else if (state == ESC_CLOSED_LOOP)
        {
            /* ── I/f (current-forced) sensorless FOC ─────────────────────
             * PI current controllers active from tick 0.
             * Phase 1 (alignment): θ=0 fixed, Iq ramps 0→ALIGN_IQ.
             * Phase 2 (I/f OL):    θ forced at pot speed, Id=0 + Iq=RAMP_IQ.
             * Phase 3 (CL):        PLL angle, speed PI → Iq reference.
             *
             * Key advantage over V/f: on low-Rs motors (A2212, 0.065Ω),
             * any angle error θ_err causes Id_waste = V*sin(θ_err)/Rs.
             * V/f cannot correct this (voltage is set, not current).
             * I/f commands Id=0 and PI instantly cancels d-axis waste. */

            /* Release PWM overrides once at CLOSED_LOOP entry */
            if (!s_ovr_released) {
                HAL_PWM_ReleaseAllOverrides();
                s_ovr_released = true;
            }

#if FOC_DIAG_PWM_TEST == 1
            /* ── DIAG 1: PWM-only — 50% duty, no FOC math ──────── */
            HAL_PWM_SetDutyFloat3Phase(0.5f, 0.5f, 0.5f);
            garudaData.focSubState = 99;
            goto foc_slow_loop;
#elif FOC_DIAG_PWM_TEST == 2
            /* ── DIAG 2: Open-loop voltage — tests current sensing ─
             * Applies fixed Vq=0.2V at θ=0 (no PI, no feedback).
             * Expected: Iq ≈ Vq/Rs = 0.2/0.065 = 3.1A (POSITIVE).
             * If Iq is NEGATIVE → current sense polarity is inverted.
             * If Iq ≈ 0 → current sensing not working.
             * focSubState=98 confirms this code path. */
            {
                float vq_test = 0.2f;  /* 0.2V → ~3A on A2212 */
                float theta_test = 0.0f;

                /* Read + convert currents for telemetry */
                AlphaBeta_t iab_diag;
                clarke_transform(ia, ib, &iab_diag);
                DQ_t idq_diag;
                park_transform(&iab_diag, theta_test, &idq_diag);

                /* Fixed voltage — no PI */
                DQ_t vdq_diag = { .d = 0.0f, .q = vq_test };
                AlphaBeta_t vab_diag;
                inv_park_transform(&vdq_diag, theta_test, &vab_diag);
                float da2, db2, dc2;
                svpwm_update(vab_diag.alpha, vab_diag.beta, s_vbus, &da2, &db2, &dc2);
                HAL_PWM_SetDutyFloat3Phase(da2, db2, dc2);

                /* Telemetry: pack id/iq into focIa/focIb for easy reading */
                garudaData.focIa    = idq_diag.d;  /* expect ~0 */
                garudaData.focIb    = idq_diag.q;  /* expect ~+3A if polarity OK */
                garudaData.focTheta = theta_test;
                garudaData.focVbus  = s_vbus;
                garudaData.focSubState = 98;
            }
            goto foc_slow_loop;
#elif FOC_DIAG_PWM_TEST == 3
            /* ── DIAG 3: FOC with PI, no feedforward ────────────── */
            /* Falls through to normal FOC but feedforward is zeroed below */
#endif

            /* ── Angle + Current Reference Management ──────────────── */
            bool in_align = (s_align_ctr < STARTUP_ALIGN_TICKS);
            float theta_drive;
            float id_ref = 0.0f;
            float iq_ref;

