bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
            if (in_align) {
                /* Phase 1: Alignment at θ=0 with gradual Iq ramp.
                 * Ramp prevents L/R transient spike (L/R=0.46ms for A2212).
                 * Iq at θ=0 creates field at 90° elec → rotor locks there. */
                s_align_ctr++;
                s_theta_ol = 0.0f;
                s_omega_ol = 0.0f;
                theta_drive = 0.0f;
                float align_frac = (float)s_align_ctr / (float)STARTUP_ALIGN_TICKS;
                iq_ref = STARTUP_ALIGN_IQ_A * align_frac;

            } else if (!s_cl_active) {
                /* Phase 2: I/f open-loop — forced angle + PI current control.
                 * POT controls speed target, slew-rate limited. PI maintains
                 * Id=0 and Iq=RAMP_IQ. No V/f formula — PI computes voltage. */
                float pot_target;
                if (throttle_raw < THROTTLE_DEADBAND) {
                    pot_target = 0.0f;
                } else {
                    float pot_frac = (float)(throttle_raw - THROTTLE_DEADBAND)
                                   / (4095.0f - (float)THROTTLE_DEADBAND);
                    pot_target = pot_frac * STARTUP_MAX_OL_RAD_S;
                }

                /* Slew-rate limited speed ramp */
                float max_delta = STARTUP_RAMP_RATE_RPS2 * FOC_TS_FAST_S;
                if (s_omega_ol < pot_target) {
                    s_omega_ol += max_delta;
                    if (s_omega_ol > pot_target) s_omega_ol = pot_target;
                } else if (s_omega_ol > pot_target) {
                    s_omega_ol -= max_delta;
                    if (s_omega_ol < pot_target) s_omega_ol = pot_target;
                }

                /* Advance forced angle */
                s_theta_ol += s_omega_ol * FOC_TS_FAST_S;
                if (s_theta_ol >= 6.28318530718f) s_theta_ol -= 6.28318530718f;
                theta_drive = s_theta_ol;

                /* I/f current: ramp from ALIGN_IQ to RAMP_IQ over IQ_RAMP_TICKS */
                if (s_iq_ramp_ctr < STARTUP_IQ_RAMP_TICKS) {
                    s_iq_ramp_ctr++;
                    float frac = (float)s_iq_ramp_ctr / (float)STARTUP_IQ_RAMP_TICKS;
                    iq_ref = STARTUP_ALIGN_IQ_A
                           + (STARTUP_RAMP_IQ_A - STARTUP_ALIGN_IQ_A) * frac;
                } else {
                    iq_ref = STARTUP_RAMP_IQ_A;
                }

#if FEATURE_CLOSED_LOOP
                /* PLL angle correction + CL transition check.
                 * Observer lag compensation: BEMF EMA introduces phase lag
                 * that makes PLL trail the true rotor. Compensate forward. */
                if (s_omega_ol >= STARTUP_HANDOFF_RAD_S) {
                    float pll_rotor = pll_rotor_angle();

                    /* Compensate observer EMA phase lag */
                    float lag_comp = OBS_LAG_COEFF * s_omega_ol * FOC_TS_FAST_S;
                    if (lag_comp > OBS_LAG_COMP_MAX_RAD) lag_comp = OBS_LAG_COMP_MAX_RAD;
                    pll_rotor += lag_comp;
                    if (pll_rotor >= 6.28318530718f) pll_rotor -= 6.28318530718f;

                    float err = pll_rotor - s_theta_ol;
                    if (err >  3.14159265f) err -= 6.28318530718f;
                    if (err < -3.14159265f) err += 6.28318530718f;

                    /* Nudge forced angle toward PLL */
                    s_theta_ol += PLL_CORRECTION_GAIN * err;
                    if (s_theta_ol < 0.0f)            s_theta_ol += 6.28318530718f;
                    if (s_theta_ol >= 6.28318530718f) s_theta_ol -= 6.28318530718f;

                    /* CL transition: PLL tracks OL within tolerance */
                    if (fabsf(err) < CL_ANGLE_TOL_RAD) {
                        if (++s_cl_lock_ctr >= CL_LOCK_COUNT) {
                            s_cl_active = true;
                            /* Bumpless transfer: seed speed PI integrator
                             * so its output matches current Iq reference.
                             * PI output = Kp*err + integrator, err≈0 at lock
                             * → integrator ≈ output ≈ iq_ref. */
                            s_pid_spd.integrator = iq_ref;
                        }
                    } else {
                        s_cl_lock_ctr = 0;
                    }
                }
#endif
            } else {
                /* Phase 3: Full closed-loop — angle + speed PI.
                 * MXLEMMING provides angle (no PLL pi/2 offset, no EMA lag).
                 * PLL provides speed (inherently filtered by PI loop filter;
                 * MXLEMMING dtheta/dt is too noisy for speed PI feedback). */
#if FEATURE_MXLEMMING
                theta_drive = s_mxl.theta_est;
#else
                theta_drive = pll_rotor_angle();
#endif
                float cl_omega = s_pll.omega_est;

                /* Speed reference from pot */
                float speed_ref;
                if (throttle_raw < THROTTLE_DEADBAND) {
                    speed_ref = 0.0f;
                } else {
                    float pot_frac = (float)(throttle_raw - THROTTLE_DEADBAND)
                                   / (4095.0f - (float)THROTTLE_DEADBAND);
                    speed_ref = pot_frac * MOTOR_MAX_ELEC_RAD_S;
                }

                /* Speed PI → Iq reference */
                iq_ref = pi_update(&s_pid_spd, speed_ref - cl_omega,
                                   FOC_TS_FAST_S);

                /* Track speed for telemetry */
                s_omega_ol = cl_omega;
            }

            /* ── FOC Pipeline: Clarke → Park → PI → InvPark → SVPWM ── */
            AlphaBeta_t iab;
            clarke_transform(ia, ib, &iab);

            DQ_t idq;
            park_transform(&iab, theta_drive, &idq);

            DQ_t vdq;
            vdq.d = pi_update(&s_pid_d, id_ref - idq.d, FOC_TS_FAST_S);
            vdq.q = pi_update(&s_pid_q, iq_ref - idq.q, FOC_TS_FAST_S);

            /* ── BEMF + cross-coupling feedforward ──────────────────── */
            {
#if FOC_DIAG_PWM_TEST == 3
                float omega_ff = 0.0f;  /* DIAG 3: feedforward disabled */
#else
                /* Always use PLL omega for feedforward — it's inherently
                 * filtered (PI loop filter), so no voltage spikes from
                 * MXLEMMING dtheta/dt noise at low flux. */
                float omega_ff = s_cl_active ? s_pll.omega_est : s_omega_ol;
#endif

                /* BEMF feedforward on q-axis */
                float bemf_ff = omega_ff * MOTOR_KE_VPEAK;
                /* Cross-coupling decoupling */
                float vd_decouple = -idq.q * omega_ff * MOTOR_LS_H;
                float vq_decouple = +idq.d * omega_ff * MOTOR_LS_H;

                vdq.d += vd_decouple;
                vdq.q += bemf_ff + vq_decouple;

