bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
                /* Circular voltage limiting (d-axis priority, Vbus/sqrt(3)) */
                float vmax = s_vbus * 0.95f * 0.577350269f;
                if (vdq.d >  vmax) vdq.d =  vmax;
                if (vdq.d < -vmax) vdq.d = -vmax;
                float sq = vmax * vmax - vdq.d * vdq.d;
                if (sq < 0.0f) sq = 0.0f;  /* FP rounding safety */
                float vq_lim = sqrtf(sq);
                if (vdq.q >  vq_lim) vdq.q =  vq_lim;
                if (vdq.q < -vq_lim) vdq.q = -vq_lim;
            }

            AlphaBeta_t vab;
            inv_park_transform(&vdq, theta_drive, &vab);

            float da, db, dc;
            svpwm_update(vab.alpha, vab.beta, s_vbus, &da, &db, &dc);
            HAL_PWM_SetDutyFloat3Phase(da, db, dc);

            /* Telemetry */
            garudaData.focIa = ia;
            garudaData.focIb = ib;
            {
                float ic_phase = -(ia + ib);
                garudaData.focIdcEst = da * ia + db * ib + dc * ic_phase;
            }

            /* Observer chain — uses shared iab and vab.
             * PLL always runs (needed for OL→CL lock detection).
             * MXLEMMING runs in parallel; drives CL angle when active. */
            {
                bemf_obs_update(&s_obs,
                                vab.alpha, vab.beta,
                                iab.alpha, iab.beta,
                                FOC_TS_FAST_S);
                pll_update(&s_pll, s_obs.e_alpha, s_obs.e_beta, FOC_TS_FAST_S);
                flux_est_update(&s_flux_est, s_obs.e_alpha, s_obs.e_beta, FOC_TS_FAST_S);
#if FEATURE_SMO
                smo_update(&s_smo,
                           vab.alpha, vab.beta,
                           iab.alpha, iab.beta);
                pll_update(&s_pll_smo, s_smo.e_alpha, s_smo.e_beta, FOC_TS_FAST_S);
#endif
#if FEATURE_MXLEMMING
                mxl_update(&s_mxl,
                           vab.alpha, vab.beta,
                           iab.alpha, iab.beta,
                           FOC_TS_FAST_S);
#endif
            }

            /* Update telemetry for GSP/GUI.
             * focSubState: 0=align, 1=OL ramp, 2=OL+PLL tracking, 3=CL */
            garudaData.focTheta    = theta_drive;
            garudaData.focOmega    = s_pll.omega_est;
            garudaData.focVbus     = s_vbus;
#if FEATURE_MXLEMMING
            garudaData.focTheta2   = s_mxl.theta_est;
#else
            garudaData.focTheta2   = pll_rotor_angle();
#endif
            garudaData.focSubState = in_align ? 0
                                   : s_cl_active ? 3
                                   : (s_omega_ol >= STARTUP_HANDOFF_RAD_S ? 2 : 1);
            garudaData.focOffsetIa = s_ia_offset;
            garudaData.focOffsetIb = s_ib_offset;
#if FEATURE_SMO
            garudaData.focSmoTheta = smo_rotor_angle();
            garudaData.focSmoOmega = s_pll_smo.omega_est;
#endif

            /* Phase current overcurrent protection (ibusRaw=0 at PWM valley).
             * Use |Ia|+|Ib| > FAULT_OC_A as fast proxy for peak phase current.
             * Debounce 2ms to reject switching transients. */
            {
                float i_mag = fabsf(ia) + fabsf(ib);
                if (i_mag > FAULT_OC_A) {
                    if (++s_foc_oc_ctr >= FOC_OC_DEBOUNCE) {
                        HAL_MC1PWMDisableOutputs();
                        garudaData.state     = ESC_FAULT;
                        garudaData.faultCode = FAULT_OVERCURRENT;
                        garudaData.runCommandActive = false;
                        LED2 = 0;
                        s_foc_oc_ctr = 0;
                    }
                } else {
                    s_foc_oc_ctr = 0;
                }
            }

            /* Stall detection — only when throttle demands motion.
             * In I/f: stall = PLL speed near zero while forced angle advancing. */
            if (throttle_raw >= THROTTLE_DEADBAND &&
                !in_align &&
                fabsf(s_pll.omega_est) < FAULT_STALL_RAD_S &&
                s_omega_ol > STARTUP_HANDOFF_RAD_S) {
                if (++s_stall_ctr >= (uint32_t)(FAULT_STALL_TIMEOUT_MS * FOC_SLOW_DIV)) {
                    HAL_MC1PWMDisableOutputs();
                    garudaData.state     = ESC_FAULT;
                    garudaData.faultCode = FAULT_STALL;
                    garudaData.runCommandActive = false;
                    LED2 = 0;
                    s_stall_ctr = 0;
                }
            } else {
                s_stall_ctr = 0;
            }
        }
        else if (state == ESC_FAULT)
        {
            HAL_MC1PWMDisableOutputs();
        }
        /* ESC_IDLE, ESC_ARMED: handled above (offset cal + goto slow loop) */

    foc_slow_loop:
        /* ── Slow loop (every FOC_SLOW_DIV ticks → 1 kHz) ────────────── */
        if (++s_slow_ctr >= FOC_SLOW_DIV)
        {
            s_slow_ctr = 0;
            state = garudaData.state;  /* Re-read after fast loop may have changed it */

            /* Arming counter — moved from Timer1 ISR to avoid cross-ISR races */
            if (state == ESC_ARMED)
            {
                if (throttle_raw < THROTTLE_DEADBAND) {
                    if (++garudaData.armCounter >= (uint32_t)FOC_ARM_TIME_MS) {
                        /* Throttle held at zero for ARM_TIME_MS → enter FOC */
                        foc_startup_reset();
                        bemf_obs_reset(&s_obs);
                        pll_reset(&s_pll);
#if FEATURE_SMO
                        smo_reset(&s_smo);
                        pll_reset(&s_pll_smo);
#endif
                        /* Pre-load center duty before releasing overrides */
                        HAL_PWM_SetDutyFloat3Phase(0.5f, 0.5f, 0.5f);
                        garudaData.state = ESC_CLOSED_LOOP;
                        LED2 = 1;
                    }
                } else {
                    garudaData.armCounter = 0;
                }
            }
        }
    } /* end FOC scope */
#elif FEATURE_FOC_V2
    /* ── FOC v2 control path — closed-loop current control ──────────
     * Architecture: MXLEMMING flux observer + Tustin PI + SVPWM.
     * True Id/Iq current control from tick 0. No V/f waste.
     * State machine: IDLE → ARMED → ALIGN → IF_RAMP → CLOSED_LOOP
     */
    {
        /* Sync mode from main loop state changes */
        if (garudaData.state == ESC_DETECT && s_foc_v2.mode == FOC_IDLE) {
            /* Auto-detect triggered from main loop (GSP command) */
            foc_detect_start(&s_foc_v2);
        } else if (garudaData.state == ESC_ARMED && s_foc_v2.mode == FOC_IDLE) {
            s_foc_v2.mode = FOC_ARMED;
            s_foc_v2.arm_ctr = 0;
        } else if (garudaData.state == ESC_IDLE &&
                   s_foc_v2.mode != FOC_IDLE &&
                   s_foc_v2.mode != FOC_MOTOR_DETECT) {
            s_foc_v2.mode = FOC_IDLE;
            /* Reset calibration for next run */
            s_foc_v2.cal_done = false;
            s_foc_v2.cal_count = 0;
            s_foc_v2.cal_accum_a = 0;
            s_foc_v2.cal_accum_b = 0;
        }

        /* Re-init FOC with updated motor params (after profile load) */
        if (gspFocReinitNeeded && s_foc_v2.mode == FOC_IDLE) {
            FOC_MotorParams_t mp = BuildFocMotorParams();
            foc_v2_init(&s_foc_v2, &mp);
            gspFocReinitNeeded = false;
        }

