bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
        /* Populate duty for telemetry: max of 3 SVPWM phase duties */
        {
            float dmax = da_v2;
            if (db_v2 > dmax) dmax = db_v2;
            if (dc_v2 > dmax) dmax = dc_v2;
            garudaData.duty = (uint32_t)(dmax * LOOPTIME_TCY);
        }

#if FEATURE_BURST_SCOPE
        /* Write burst scope sample from ISR-local FOC state */
        {
            SCOPE_SAMPLE_T ss;
            ss.ia    = (int16_t)(garudaData.focIa * 1000.0f);
            ss.ib    = (int16_t)(garudaData.focIb * 1000.0f);
            ss.id    = (int16_t)(s_foc_v2.id_meas * 1000.0f);
            ss.iq    = (int16_t)(s_foc_v2.iq_meas * 1000.0f);
            ss.vd    = (int16_t)(s_foc_v2.vd * 100.0f);
            ss.vq    = (int16_t)(s_foc_v2.vq * 100.0f);
            ss.theta = (int16_t)(s_foc_v2.theta * 10000.0f);
            ss.obs_x1 = (int16_t)(s_foc_v2.obs.x1 * 100000.0f);
            ss.obs_x2 = (int16_t)(s_foc_v2.obs.x2 * 100000.0f);
            /* Omega ×1 scaling (1 rad/s resolution, range ±32767).
             * ×10 overflows int16 at 3276 rad/s — A2212 reaches 6000+. */
            {
                float omega_clamped = s_foc_v2.omega_pll;
                if (omega_clamped > 32767.0f) omega_clamped = 32767.0f;
                if (omega_clamped < -32768.0f) omega_clamped = -32768.0f;
                ss.omega = (int16_t)(omega_clamped);
            }
            ss.mod_index = (int16_t)(garudaData.focModIndex * 10000.0f);
            ss.flags  = (s_foc_v2.cl_active ? 0x01 : 0x00)
                      | ((garudaData.state == ESC_FAULT) ? 0x02 : 0x00)
                      | (((uint8_t)s_foc_v2.mode & 0x07) << 2);
            ss.state  = (uint8_t)garudaData.state;
            ss.tick_lsb = (uint16_t)(garudaData.systemTick & 0xFFFF);
            Scope_WriteSample(&ss);
        }
#endif
#endif
    } /* end FOC v2 scope */
#elif FEATURE_FOC_V3
    /* ── FOC v3 control path — SMO observer + OL ramp startup ──────
     * Architecture: Sliding Mode Observer + Tustin PI + SVPWM.
     * State machine: IDLE → ARMED → ALIGN → OL_RAMP → CLOSED_LOOP
     */
    {
        /* Sync mode from main loop state changes */
        if (garudaData.state == ESC_ARMED && s_foc_v3.mode == V3_IDLE) {
            s_foc_v3.mode = V3_ARMED;
            s_foc_v3.arm_ctr = 0;
        } else if (garudaData.state == ESC_IDLE &&
                   s_foc_v3.mode != V3_IDLE) {
            s_foc_v3.mode = V3_IDLE;
            s_foc_v3.cal_done = false;
            s_foc_v3.cal_count = 0;
            s_foc_v3.cal_accum_a = 0;
            s_foc_v3.cal_accum_b = 0;
        }

        /* Re-init FOC with updated motor params (after profile load) */
        if (gspFocReinitNeeded && s_foc_v3.mode == V3_IDLE) {
            FOC_MotorParams_t mp = BuildFocMotorParams();
            foc_v3_init(&s_foc_v3, &mp);
            gspFocReinitNeeded = false;
        }

        uint16_t throttle_v3 = garudaData.throttle;

        float da_v3, db_v3, dc_v3;
        foc_v3_fast_tick(&s_foc_v3,
                         raw_ia, raw_ib,
                         garudaData.vbusRaw, throttle_v3,
                         &da_v3, &db_v3, &dc_v3);

        /* Release PWM overrides when entering active modes */
        {
            static bool v3_ovr_released = false;
            if (s_foc_v3.mode >= V3_ALIGN && s_foc_v3.mode <= V3_CLOSED_LOOP) {
                if (!v3_ovr_released) {
                    HAL_PWM_ReleaseAllOverrides();
                    v3_ovr_released = true;
                }
                HAL_PWM_SetDutyFloat3Phase(da_v3, db_v3, dc_v3);
            } else if (s_foc_v3.mode == V3_FAULT && v3_ovr_released) {
                HAL_PWM_SetDutyFloat3Phase(0.5f, 0.5f, 0.5f);
            } else {
                v3_ovr_released = false;
            }
        }

        /* Map FOC v3 mode to ESC state for main loop compatibility */
        switch (s_foc_v3.mode) {
            case V3_IDLE:         garudaData.state = ESC_IDLE; break;
            case V3_ARMED:        garudaData.state = ESC_ARMED; break;
            case V3_ALIGN:        garudaData.state = ESC_ALIGN; break;
            case V3_OL_RAMP:      garudaData.state = ESC_OL_RAMP; break;
            case V3_CLOSED_LOOP:  garudaData.state = ESC_CLOSED_LOOP; break;
            case V3_FAULT:        garudaData.state = ESC_FAULT; break;
            default:              garudaData.state = ESC_FAULT; break;
        }

        /* Fault propagation */
        if (s_foc_v3.mode == V3_FAULT) {
            HAL_MC1PWMDisableOutputs();
            if (garudaData.faultCode == FAULT_NONE)
                garudaData.faultCode = s_foc_v3.fault_code ? s_foc_v3.fault_code : FAULT_FOC_INTERNAL;
            garudaData.runCommandActive = false;
            LED2 = 0;
        }

        /* Telemetry update */
        garudaData.focIdMeas   = s_foc_v3.id_meas;
        garudaData.focIqMeas   = s_foc_v3.iq_meas;
        garudaData.focTheta    = s_foc_v3.theta;
        garudaData.focOmega    = s_foc_v3.omega_pll;
        garudaData.focVbus     = s_foc_v3.vbus;
        garudaData.focIa       = v2_counts_to_amps(raw_ia, (uint16_t)s_foc_v3.ia_offset);
        garudaData.focIb       = v2_counts_to_amps(raw_ib, (uint16_t)s_foc_v3.ib_offset);
        garudaData.focThetaObs = s_foc_v3.theta_obs;
        garudaData.focVd       = s_foc_v3.vd;
        garudaData.focVq       = s_foc_v3.vq;
        /* SMO internals → flux telemetry fields (repurposed) */
        garudaData.focFluxAlpha   = s_foc_v3.smo.e_alpha_filt;
        garudaData.focFluxBeta    = s_foc_v3.smo.e_beta_filt;
        garudaData.focLambdaEst   = 0.0f;
        garudaData.focObsGain     = s_foc_v3.smo.K_base;
        garudaData.focPidDInteg   = s_foc_v3.pid_d.integral;
        garudaData.focPidQInteg   = s_foc_v3.pid_q.integral;
        garudaData.focPidSpdInteg = s_foc_v3.pid_spd.integral;
        /* Derived diagnostics */
        {
            float vd = s_foc_v3.vd, vq = s_foc_v3.vq;
            float vbus = s_foc_v3.vbus;
            float v_mag = sqrtf(vd * vd + vq * vq);
            float v_max = vbus * 0.57735027f;
            garudaData.focModIndex = (v_max > 0.1f) ? (v_mag / v_max) : 0.0f;
            garudaData.focObsConfidence = s_foc_v3.smo.confidence;
        }
        garudaData.focSubState = s_foc_v3.sub_state;
        garudaData.focOffsetIa = (uint16_t)s_foc_v3.ia_offset;
        garudaData.focOffsetIb = (uint16_t)s_foc_v3.ib_offset;

        /* Duty for telemetry */
        {
            float dmax = da_v3;
            if (db_v3 > dmax) dmax = db_v3;
            if (dc_v3 > dmax) dmax = dc_v3;
            garudaData.duty = (uint32_t)(dmax * LOOPTIME_TCY);
        }

#if FEATURE_BURST_SCOPE
        /* Burst scope sample from v3 state */
        {
            SCOPE_SAMPLE_T ss;
            ss.ia    = (int16_t)(garudaData.focIa * 1000.0f);
            ss.ib    = (int16_t)(garudaData.focIb * 1000.0f);
            ss.id    = (int16_t)(s_foc_v3.id_meas * 1000.0f);
            ss.iq    = (int16_t)(s_foc_v3.iq_meas * 1000.0f);
            ss.vd    = (int16_t)(s_foc_v3.vd * 100.0f);
            ss.vq    = (int16_t)(s_foc_v3.vq * 100.0f);
            ss.theta = (int16_t)(s_foc_v3.theta * 10000.0f);
            ss.obs_x1 = (int16_t)(s_foc_v3.smo.e_alpha_filt * 100000.0f);
            ss.obs_x2 = (int16_t)(s_foc_v3.smo.e_beta_filt * 100000.0f);
            {
                float omega_clamped = s_foc_v3.omega_pll;
                if (omega_clamped > 32767.0f) omega_clamped = 32767.0f;
                if (omega_clamped < -32768.0f) omega_clamped = -32768.0f;
                ss.omega = (int16_t)(omega_clamped);
            }
            ss.mod_index = (int16_t)(garudaData.focModIndex * 10000.0f);
            ss.flags  = (s_foc_v3.cl_active ? 0x01 : 0x00)
                      | ((garudaData.state == ESC_FAULT) ? 0x02 : 0x00)
                      | (((uint8_t)s_foc_v3.mode & 0x07) << 2);
            ss.state  = (uint8_t)garudaData.state;
            ss.tick_lsb = (uint16_t)(garudaData.systemTick & 0xFFFF);
            Scope_WriteSample(&ss);
        }
#endif
    } /* end FOC v3 scope */
#else
    /* ── 6-step state machine ── */
    /* State machine */
    switch (garudaData.state)
    {
        case ESC_IDLE:
        case ESC_ARMED:
            break;

#if FEATURE_SINE_STARTUP
        case ESC_ALIGN:
        case ESC_OL_RAMP:
            if (garudaData.sine.active)
            {
                uint32_t dA, dB, dC;
                STARTUP_SineComputeDuties(&garudaData, &dA, &dB, &dC);
                HAL_PWM_SetDutyCycle3Phase(dA, dB, dC);
            }
            break;

