bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
        case ESC_MORPH:
        {
            if (garudaData.morph.subPhase == MORPH_CONVERGE)
            {
                /* Sub-phase A: blended duties, all 3 phases driven */
                uint32_t dA, dB, dC;
                STARTUP_MorphComputeDuties(&garudaData, &dA, &dB, &dC);

#if FEATURE_HW_OVERCURRENT
                /* Current-proportional duty reduction during convergence.
                 * Same logic as CL SW OC limiter but applied to all 3 phases. */
                if (garudaData.ibusRaw > OC_SW_LIMIT_ADC)
                {
                    uint16_t excess = garudaData.ibusRaw - OC_SW_LIMIT_ADC;
                    uint16_t range = RT_OC_CMP3_DAC_VAL - OC_SW_LIMIT_ADC;
                    if (range == 0) range = 1;
                    /* Scale factor: 256 = no reduction, 0 = full cut */
                    uint32_t scale = 256;
                    uint32_t reduction = ((uint32_t)excess * 256u) / range;
                    if (reduction >= scale)
                        scale = 0;
                    else
                        scale -= reduction;
                    dA = (dA * scale) >> 8;
                    dB = (dB * scale) >> 8;
                    dC = (dC * scale) >> 8;
                    if (dA < MIN_DUTY) dA = MIN_DUTY;
                    if (dB < MIN_DUTY) dB = MIN_DUTY;
                    if (dC < MIN_DUTY) dC = MIN_DUTY;
                }
#endif
                HAL_PWM_SetDutyCycle3Phase(dA, dB, dC);

                if (STARTUP_MorphCheckSectorBoundary(&garudaData))
                {
                    if (garudaData.morph.alpha >= 256)
                    {
                        /* Convergence complete → enter Windowed Hi-Z */
                        garudaData.morph.alpha = 256;
                        garudaData.morph.subPhase = MORPH_WINDOWED_HIZ;
                        garudaData.morph.sectorCount = 0;
                        garudaData.morph.tickInStep = 0;
                        garudaData.morph.floatIsHiZ = false;
                        garudaData.morph.morphZcCount = 0;
                        garudaData.morph.forceThreshSeed = true;
                        garudaData.sine.active = false;

                        /* Apply 6-step via commutation module, then release float */
                        COMMUTATION_ApplyStep(&garudaData,
                                              garudaData.morph.morphStep);
                        HAL_PWM_ReleaseFloatPhase(garudaData.currentStep);

                        /* Trap duty for active phase */
                        uint32_t td = ((uint32_t)garudaData.sine.amplitude
                            * SINE_TRAP_DUTY_NUM + SINE_TRAP_DUTY_DEN / 2)
                            / SINE_TRAP_DUTY_DEN;
                        if (td < MIN_DUTY) td = MIN_DUTY;
                        if (td > RT_RAMP_DUTY_CAP) td = RT_RAMP_DUTY_CAP;
                        garudaData.duty = td;

                        /* Float driven at trapFloat — virtual neutral */
                        uint32_t trapFloat = (td + MIN_DUTY) / 2;
                        const COMMUTATION_STEP_T *s =
                            &commutationTable[garudaData.currentStep];
                        uint32_t dA = (s->phaseA == PHASE_PWM_ACTIVE) ? td :
                                      (s->phaseA == PHASE_FLOAT) ? trapFloat : MIN_DUTY;
                        uint32_t dB = (s->phaseB == PHASE_PWM_ACTIVE) ? td :
                                      (s->phaseB == PHASE_FLOAT) ? trapFloat : MIN_DUTY;
                        uint32_t dC = (s->phaseC == PHASE_PWM_ACTIVE) ? td :
                                      (s->phaseC == PHASE_FLOAT) ? trapFloat : MIN_DUTY;
                        HAL_PWM_SetDutyCycle3Phase(dA, dB, dC);

                        /* Seed forced timing + snapshot */
                        uint16_t handoff =
                            TIMER1_TO_ADC_TICKS(garudaData.rampStepPeriod);
                        garudaData.timing.stepPeriod = handoff;
                        garudaData.timing.forcedCountdown = handoff;
                        garudaData.morph.stepPeriodSnap = handoff;

                        BEMF_ZC_Init(&garudaData, handoff);
                        BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                    }
                }
            }
            else if (garudaData.morph.subPhase == MORPH_WINDOWED_HIZ)
            {
                static const uint8_t windowSchedule[] = MORPH_WINDOW_SCHEDULE;

                garudaData.morph.tickInStep++;

                /* --- Window bounds from SNAPSHOT period --- */
                uint8_t schedIdx = garudaData.morph.sectorCount;
                if (schedIdx >= MORPH_WINDOW_SECTORS)
                    schedIdx = MORPH_WINDOW_SECTORS - 1;
                uint8_t pct = windowSchedule[schedIdx];
                uint16_t sp = garudaData.morph.stepPeriodSnap;
                uint16_t width = (uint16_t)(((uint32_t)sp * pct + 50) / 100);

                /* fix #4: enforce minimum absolute window width */
                if (width < MORPH_WINDOW_MIN_TICKS && pct < 100)
                    width = MORPH_WINDOW_MIN_TICKS;
                if (width > sp)
                    width = sp;

                uint16_t winOpen = (sp - width) / 2;
                uint16_t winClose = winOpen + width;

                /* --- Window state transitions --- */
                bool inWindow = (garudaData.morph.tickInStep >= winOpen
                              && garudaData.morph.tickInStep < winClose);

                /* At 100%, keep Hi-Z for entire step — no window-close */
                if (pct >= 100)
                    inWindow = true;

                bool justOpenedWindow = false;

                if (inWindow && !garudaData.morph.floatIsHiZ)
                {
                    HAL_PWM_FloatPhaseToHiZ(garudaData.currentStep);
                    garudaData.morph.floatIsHiZ = true;
                    garudaData.bemf.ad2SettleCount = ZC_AD2_SETTLE_SAMPLES;
                    justOpenedWindow = true;
                }
                else if (!inWindow && garudaData.morph.floatIsHiZ)
                {
                    HAL_PWM_ReleaseFloatPhase(garudaData.currentStep);
                    garudaData.morph.floatIsHiZ = false;
                }

                /* --- OC limiter BEFORE duty write --- */
#if FEATURE_HW_OVERCURRENT
                if (garudaData.ibusRaw > OC_SW_LIMIT_ADC)
                {
                    uint16_t excess = garudaData.ibusRaw - OC_SW_LIMIT_ADC;
                    uint16_t range = RT_OC_CMP3_DAC_VAL - OC_SW_LIMIT_ADC;
                    if (range == 0) range = 1;
                    uint32_t reduction = ((uint32_t)excess
                        * (garudaData.duty - MIN_DUTY)) / range;
                    if (reduction >= garudaData.duty - MIN_DUTY)
                        garudaData.duty = MIN_DUTY;
                    else
                        garudaData.duty -= reduction;
                }
#endif

                /* --- Duty write EVERY tick (after OC) --- */
                if (garudaData.morph.floatIsHiZ)
                    HAL_PWM_SetDutyCycle(garudaData.duty);
                else
                    MORPH_WRITE_TRAP_DUTIES(garudaData.currentStep, garudaData.duty);

                /* --- BEMF polling inside Hi-Z window (skip open tick) --- */
                if (garudaData.morph.floatIsHiZ && !justOpenedWindow)
                {
                    bool wasDetected = garudaData.bemf.zeroCrossDetected;
                    uint8_t spacing = garudaData.timing.stepsSinceLastZc;
                    BEMF_ZC_Poll(&garudaData, adcIsrTick);
                    bool newZcThisTick = (!wasDetected
                        && garudaData.bemf.zeroCrossDetected);

