bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
                    if (newZcThisTick)
                    {
                        garudaData.morph.morphZcCount++;
                        if (garudaData.morph.morphZcCount >= 2 && spacing == 1)
                        {
                            uint16_t measured = (uint16_t)(adcIsrTick
                                - garudaData.morph.lastZcTick);
                            uint16_t mHandoff =
                                TIMER1_TO_ADC_TICKS(garudaData.rampStepPeriod);
                            if (measured < mHandoff) measured = mHandoff;
                            uint16_t maxM = mHandoff + (mHandoff >> 1);
                            if (measured > maxM) measured = maxM;
                            int32_t delta = (int32_t)measured
                                - (int32_t)garudaData.timing.stepPeriod;
                            garudaData.timing.stepPeriod = (uint16_t)(
                                (int32_t)garudaData.timing.stepPeriod
                                + (delta >> 3));
                        }
                        garudaData.morph.lastZcTick = adcIsrTick;
                    }
                }

                /* --- Forced commutation --- */
                if (garudaData.timing.forcedCountdown > 0)
                    garudaData.timing.forcedCountdown--;

                if (garudaData.timing.forcedCountdown == 0)
                {
                    /* fix #1: detect terminal sector BEFORE touching overrides.
                     * On terminal step, go straight to MORPH_HIZ with Hi-Z
                     * intact — no driven→Hi-Z transient on the float phase. */
                    bool isTerminal =
                        (garudaData.morph.sectorCount + 1 >= MORPH_WINDOW_SECTORS);

                    COMMUTATION_AdvanceStep(&garudaData);
                    /* AdvanceStep → ApplyStep sets float to Hi-Z via
                     * SetCommutationStep. On non-terminal steps: release
                     * float to driven for next window. On terminal step:
                     * KEEP Hi-Z (skip release + driven write). */

                    if (!isTerminal)
                    {
                        HAL_PWM_ReleaseFloatPhase(garudaData.currentStep);
                        MORPH_WRITE_TRAP_DUTIES(garudaData.currentStep,
                                                garudaData.duty);
                        garudaData.morph.floatIsHiZ = false;
                    }
                    /* else: float stays Hi-Z from AdvanceStep → ApplyStep */

                    garudaData.morph.tickInStep = 0;
                    garudaData.timing.forcedCountdown =
                        garudaData.timing.stepPeriod;
                    garudaData.morph.stepPeriodSnap =
                        garudaData.timing.stepPeriod;
                    garudaData.morph.sectorCount++;

                    BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);

                    /* --- Schedule complete → enter full MORPH_HIZ --- */
                    if (garudaData.morph.sectorCount >= MORPH_WINDOW_SECTORS)
                    {
                        garudaData.morph.subPhase = MORPH_HIZ;
                        garudaData.morph.sectorCount = 0;
                        garudaData.morph.floatIsHiZ = true; /* fix #5 */
                        HAL_PWM_SetDutyCycle(garudaData.duty);
                    }
                }

                /* Staleness decay */
                if (garudaData.timing.stepsSinceLastZc > ZC_STALENESS_LIMIT)
                {
                    garudaData.timing.goodZcCount = 0;
                    garudaData.timing.risingZcWorks = false;
                    garudaData.timing.fallingZcWorks = false;
                }
            }
            else /* MORPH_HIZ */
            {
                /* Sub-phase C: real 6-step, BEMF on float phase */
                bool wasDetected = garudaData.bemf.zeroCrossDetected;
                uint8_t spacing = garudaData.timing.stepsSinceLastZc;
                BEMF_ZC_Poll(&garudaData, adcIsrTick);

                /* Latch "ZC confirmed this tick" BEFORE any forced
                 * commutation runs — immune to stepsSinceLastZc race. */
                bool newZcThisTick = (!wasDetected
                    && garudaData.bemf.zeroCrossDetected);

                /* Track ZC timestamps for IIR period adaptation.
                 * Guard: only trust single-step intervals (spacing==1). */
                if (newZcThisTick)
                {
                    garudaData.morph.morphZcCount++;
                    if (garudaData.morph.morphZcCount >= 2 && spacing == 1)
                    {
                        uint16_t measured = (uint16_t)(adcIsrTick
                            - garudaData.morph.lastZcTick);
                        uint16_t mHandoff =
                            TIMER1_TO_ADC_TICKS(garudaData.rampStepPeriod);
                        /* Clamp to [handoff, 1.5× handoff] */
                        if (measured < mHandoff)
                            measured = mHandoff;
                        uint16_t maxMeasured = mHandoff + (mHandoff >> 1);
                        if (measured > maxMeasured)
                            measured = maxMeasured;
                        /* IIR: 7/8 old + 1/8 measured */
                        int32_t delta = (int32_t)measured
                            - (int32_t)garudaData.timing.stepPeriod;
                        garudaData.timing.stepPeriod = (uint16_t)(
                            (int32_t)garudaData.timing.stepPeriod
                            + (delta >> 3));
                    }
                    garudaData.morph.lastZcTick = adcIsrTick;
                }

                /* Forced commutation (open-loop timing) */
                bool forcedStepThisTick = false;
                if (garudaData.timing.forcedCountdown > 0)
                    garudaData.timing.forcedCountdown--;

                if (garudaData.timing.forcedCountdown == 0)
                {
                    COMMUTATION_AdvanceStep(&garudaData);
                    BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                    garudaData.timing.forcedCountdown =
                        garudaData.timing.stepPeriod;
                    garudaData.morph.sectorCount++;
                    forcedStepThisTick = true;
                }

                /* Staleness decay: mirror pre-sync pattern */
                if (garudaData.timing.stepsSinceLastZc > ZC_STALENESS_LIMIT)
                {
                    garudaData.timing.goodZcCount = 0;
                    garudaData.timing.risingZcWorks = false;
                    garudaData.timing.fallingZcWorks = false;
                }

                /* ZC confidence gate → exit morph */
                if (garudaData.timing.goodZcCount >= MORPH_ZC_THRESHOLD
                    && garudaData.timing.risingZcWorks
                    && garudaData.timing.fallingZcWorks
                    && newZcThisTick)
                {
                    garudaData.timing.zcSynced = true;

                    /* Seed first post-sync commutation deadline */
                    if (forcedStepThisTick)
                    {
                        garudaData.timing.commDeadline = (uint16_t)(
                            adcIsrTick + garudaData.timing.stepPeriod);
                    }
                    else if (garudaData.morph.morphZcCount >= 1)
                    {
                        garudaData.timing.commDeadline = (uint16_t)(
                            garudaData.morph.lastZcTick
                            + garudaData.timing.stepPeriod / 2);
                    }
                    else
                    {
                        garudaData.timing.commDeadline = (uint16_t)(
                            adcIsrTick + garudaData.timing.stepPeriod);
                    }
                    garudaData.timing.deadlineActive = true;
#if FEATURE_BEMF_INTEGRATION || FEATURE_ADC_CMP_ZC
                    /* Only mark as ZC-timed when deadline is anchored
                     * to an actual ZC event (not a forced-step fallback).
                     * Downstream HWZC handoff gating uses this flag. */
                    garudaData.timing.deadlineIsZc = !forcedStepThisTick;
#endif

                    garudaData.state = ESC_CLOSED_LOOP;
                    break;
                }

                /* Sector timeout */
                if (garudaData.morph.sectorCount >= MORPH_HIZ_MAX_SECTORS)
                {
                    if (garudaData.timing.goodZcCount >= 3)
                    {
                        /* Partial lock — let CL pre-sync finish.
                         * Sync rampStepPeriod from IIR-adapted stepPeriod
                         * so CL entry re-init doesn't discard morph's
                         * speed tracking and jump back to ramp-end rate.
                         * Inverse of TIMER1_TO_ADC_TICKS: t1 = adc * 5/12 */
                        garudaData.rampStepPeriod = (uint16_t)(
                            ((uint32_t)garudaData.timing.stepPeriod * 5 + 6) / 12);
                        garudaData.state = ESC_CLOSED_LOOP;
                    }
                    else
                    {
                        HAL_MC1PWMDisableOutputs();
#if FEATURE_HW_OVERCURRENT
                        HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                        garudaData.state = ESC_FAULT;
                        garudaData.faultCode = FAULT_MORPH_TIMEOUT;
                        garudaData.runCommandActive = false;
                        LED2 = 0;
                    }
                }


