bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
#if FEATURE_HW_OVERCURRENT
                /* SW OC soft limiter — same as CL (proportional duty cut) */
                if (garudaData.ibusRaw > OC_SW_LIMIT_ADC)
                {
                    uint16_t excess = garudaData.ibusRaw - OC_SW_LIMIT_ADC;
                    uint16_t range = RT_OC_CMP3_DAC_VAL - OC_SW_LIMIT_ADC;
                    if (range == 0) range = 1;
                    uint32_t reduction = ((uint32_t)excess
                        * (garudaData.duty - MIN_DUTY)) / range;
                    if (reduction >= garudaData.duty - MIN_DUTY)
                        garudaData.duty = MIN_DUTY;
                    else
                        garudaData.duty -= reduction;
                }
#endif
                HAL_PWM_SetDutyCycle(garudaData.duty);
            }

            /* Absolute timeout — covers BOTH sub-phases.
             * If motor stalls during CONVERGE (e.g. prop overload),
             * this is the only exit path. */
            if ((garudaData.systemTick
                - garudaData.morph.entryTick) > MORPH_TIMEOUT_MS)
            {
                HAL_MC1PWMDisableOutputs();
#if FEATURE_HW_OVERCURRENT
                HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                garudaData.state = ESC_FAULT;
                garudaData.faultCode = FAULT_MORPH_TIMEOUT;
                garudaData.runCommandActive = false;
                LED2 = 0;
            }
            break;
        }
#else
        case ESC_ALIGN:
        case ESC_OL_RAMP:
            break;
#endif

#if DIAGNOSTIC_MANUAL_STEP
        case ESC_CLOSED_LOOP:
            /* Manual step mode: ADC ISR just holds duty. No automatic commutation. */
            HAL_PWM_SetDutyCycle(garudaData.duty);
            break;
#elif FEATURE_BEMF_CLOSED_LOOP
        case ESC_CLOSED_LOOP:
        {
            /* Throttle-zero shutdown: if pot returns to zero after being raised,
             * gracefully stop. Don't wait for desync — at low duty the HW ZC
             * comparator can trigger on noise indefinitely, keeping the motor
             * in a stalled-but-"running" state (audible buzz).
             *
             * hasSeenThrottle prevents false shutdown at CL entry — the arming
             * gate requires pot=0, so pot is still at zero when CL starts.
             * Only arm the shutdown after the user has raised the pot once. */
            {
                static bool hasSeenThrottle = false;
                static uint16_t zeroThrottleCount = 0;

                if (prevAdcState != ESC_CLOSED_LOOP)
                {
                    hasSeenThrottle = false;
                    zeroThrottleCount = 0;
                }

                if (garudaData.throttle >= ARM_THROTTLE_ZERO_ADC)
                    hasSeenThrottle = true;

                if (hasSeenThrottle && garudaData.throttle < ARM_THROTTLE_ZERO_ADC)
                {
                    if (++zeroThrottleCount >= (PWMFREQUENCY_HZ / 20))  /* 50ms */
                    {
#if FEATURE_ADC_CMP_ZC
                        if (garudaData.hwzc.enabled)
                            HWZC_Disable(&garudaData);
                        garudaData.hwzc.fallbackPending = false;
#endif
#if FEATURE_HW_OVERCURRENT
                        HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
                        HAL_MC1PWMDisableOutputs();
                        garudaData.runCommandActive = false;
                        garudaData.state = ESC_IDLE;
                        LED2 = 0;
                        zeroThrottleCount = 0;
                        break;
                    }
                }
                else
                {
                    zeroThrottleCount = 0;
                }
            }

            /* Detect first entry into CLOSED_LOOP (state transition) */
            if (prevAdcState != ESC_CLOSED_LOOP)
            {
#if FEATURE_SINE_STARTUP
                /* Morph hot handoff: ZC already locked, skip re-init.
                 * Gate on prevAdcState == ESC_MORPH (not just zcSynced)
                 * to prevent stale state from a previous run triggering
                 * the hot-handoff path from OL_RAMP. */
                if (prevAdcState == ESC_MORPH
                    && garudaData.timing.zcSynced)
                {
                    garudaData.desyncRestartAttempts = 0;
#if FEATURE_HW_OVERCURRENT
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
#if FEATURE_ADC_CMP_ZC
                    garudaData.hwzc.fallbackPending = false;
                    garudaData.hwzc.enablePending = false;
                    garudaData.hwzc.dbgLatchDisable = false;
#endif
                }
                else
#endif
                {
                    /* Normal CL entry (from OL_RAMP or morph without lock) */
                    uint16_t initPeriod = TIMER1_TO_ADC_TICKS(garudaData.rampStepPeriod);
                    if (initPeriod < MIN_ADC_STEP_PERIOD)
                        initPeriod = MIN_ADC_STEP_PERIOD;
                    if (initPeriod > RT_INITIAL_ADC_STEP_PERIOD)
                        initPeriod = RT_INITIAL_ADC_STEP_PERIOD;
                    BEMF_ZC_Init(&garudaData, initPeriod);
                    BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                    garudaData.bemf.ad2SettleCount = ZC_AD2_SETTLE_SAMPLES;
#if FEATURE_ADC_CMP_ZC
                    /* Clear stale HWZC state from any prior run */
                    garudaData.hwzc.fallbackPending = false;
                    garudaData.hwzc.enablePending = false;
                    garudaData.hwzc.dbgLatchDisable = false;

#if FEATURE_PRESYNC_RAMP
                    /* Defensively disable HWZC: stale hwzc.enabled=true from a
                     * prior run (e.g. desync recovery) would skip the entire SW
                     * pre-sync block (line ~479 gates on !hwzc.enabled). Force
                     * HWZC off so pre-sync runs. Clear fallbackPending to prevent
                     * stale HWZC state from re-seeding SW ZC. */
                    if (garudaData.hwzc.enabled)
                        HWZC_Disable(&garudaData);
                    garudaData.hwzc.fallbackPending = false;
#else
                    /* Immediate HWZC enable for motors with reliable OL ramp
                     * delivery speed (non-presync-ramp path). */
                    {
                        uint32_t curErpm = ERPM_FROM_ADC_STEP_NUM / initPeriod;
                        if (curErpm >= RT_HWZC_CROSSOVER_ERPM)
                        {
                            HWZC_Enable(&garudaData);
                        }
                    }
#endif
#endif
                }
            }

#if FEATURE_ADC_CMP_ZC
            /* HW->SW fallback re-seed (Rule 9) */
            if (garudaData.hwzc.fallbackPending)
            {
                garudaData.hwzc.fallbackPending = false;
                garudaData.hwzc.enablePending = false;
                uint16_t swPeriod = HWZC_SCCP2_TO_ADC(
                    garudaData.hwzc.stepPeriodHR);
                if (swPeriod < MIN_ADC_STEP_PERIOD)
                    swPeriod = MIN_ADC_STEP_PERIOD;
                if (swPeriod > RT_INITIAL_ADC_STEP_PERIOD)
                    swPeriod = RT_INITIAL_ADC_STEP_PERIOD;
                BEMF_ZC_Init(&garudaData, swPeriod);
                BEMF_ZC_OnCommutation(&garudaData, adcIsrTick);
                garudaData.bemf.ad2SettleCount = ZC_AD2_SETTLE_SAMPLES;

                if (garudaData.hwzc.goodZcCount >= RT_ZC_SYNC_THRESHOLD)
                {
                    /* HW ZC had good lock — seed as synced to avoid
                     * pre-sync forced-commutation jerk at transition */
                    garudaData.timing.zcSynced = true;
                    garudaData.timing.goodZcCount = RT_ZC_SYNC_THRESHOLD;
                    garudaData.timing.forcedCountdown =
                        swPeriod * ZC_TIMEOUT_MULT;
#if FEATURE_HW_OVERCURRENT
                    /* Lower CMP3 from startup to operational threshold */
                    HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
                }
                else
                {
                    /* HW ZC was struggling — conservative pre-sync */
                    garudaData.timing.zcSynced = false;
                    garudaData.timing.forcedCountdown = swPeriod;
                }
            }

            if (!garudaData.hwzc.enabled)
            {
#endif /* FEATURE_ADC_CMP_ZC */

            if (!garudaData.timing.zcSynced)
            {
                /* === PRE-SYNC: Forced commutation + passive ZC detection === */

