bhanuprakashjh/ProjectGaruda/dspic33AKESC/garuda_service.c
        case ESC_OL_RAMP:
#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3
            /* FOC: I/f ramp handled in ADC ISR. Timer1 is a no-op. */
            break;
#elif DIAGNOSTIC_MANUAL_STEP
            garudaData.state = ESC_CLOSED_LOOP;
            break;
#elif FEATURE_SINE_STARTUP
            if (STARTUP_SineRamp(&garudaData))
            {
                /* Sine ramp complete → enter waveform morph.
                 * rampStepPeriod synced from sine eRPM in MorphInit. */
                STARTUP_MorphInit(&garudaData);
#if FEATURE_HW_OVERCURRENT
                /* Lower CMP3 from startup (22A) to operational (12A).
                 * Morph convergence can spike current above the board PCI
                 * threshold (~15A) but below CMP3 startup. Without this,
                 * CMP3 never trips and the board PCI hard-faults. */
                HAL_CMP3_SetThreshold(RT_OC_CMP3_DAC_VAL);
#endif
                garudaData.state = ESC_MORPH;
            }
            break;
#else
#if FEATURE_PRESYNC_RAMP
            /* Skip blind forced ramp. Enter CL directly with slow initial
             * step period. ADC ISR pre-sync handles feedback-gated
             * acceleration with ZC detection in parallel. */
            garudaData.duty = RT_RAMP_DUTY_CAP;
            garudaData.state = ESC_CLOSED_LOOP;
#else
            if (STARTUP_OpenLoopRamp(&garudaData))
            {
                garudaData.state = ESC_CLOSED_LOOP;
            }
#endif
            break;
#endif

        case ESC_MORPH:
#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3
            /* FOC: no morph phase. Unreachable. */
            break;
#elif FEATURE_SINE_STARTUP
            /* All morph logic runs in ADC ISR (24kHz). Timer1 is idle. */
            break;
#else
            /* Morph only used with SINE_STARTUP — unreachable here */
            break;
#endif

#if FEATURE_FOC || FEATURE_FOC_V2 || FEATURE_FOC_V3
        case ESC_CLOSED_LOOP:
            /* FOC: all control in ADC ISR. Timer1 does nothing. */
            break;
#elif DIAGNOSTIC_MANUAL_STEP
        case ESC_CLOSED_LOOP:
            /* Manual step mode: hold current step. SW2 advances from main loop. */
            break;
#elif FEATURE_BEMF_CLOSED_LOOP
        case ESC_CLOSED_LOOP:
            /* Phase 2: All commutation handled in ADC ISR. Timer1 does nothing. */
            break;
#else
        case ESC_CLOSED_LOOP:
            /* Phase 1: keep forced commutation at final ramp speed. */
            if (garudaData.rampCounter > 0)
            {
                garudaData.rampCounter--;
            }
            if (garudaData.rampCounter == 0)
            {
                COMMUTATION_AdvanceStep(&garudaData);
                garudaData.rampCounter = garudaData.rampStepPeriod;
            }
            break;
#endif

        case ESC_BRAKING:
            break;

        case ESC_RECOVERY:
#if FEATURE_DESYNC_RECOVERY
            if (garudaData.recoveryCounter > 0)
            {
                garudaData.recoveryCounter--;
            }
            else
            {
                if (garudaData.runCommandActive &&
                    garudaData.desyncRestartAttempts < RT_DESYNC_MAX_RESTARTS &&
                    garudaData.throttle >= ARM_THROTTLE_ZERO_ADC)
                {
                    garudaData.desyncRestartAttempts++;
                    STARTUP_Init(&garudaData);
                    garudaData.state = ESC_ALIGN;
                    LED2 = 1;
                }
                else if (garudaData.throttle < ARM_THROTTLE_ZERO_ADC)
                {
                    /* Throttle is zero — user wants motor stopped.
                     * Don't restart, go to IDLE. */
                    garudaData.runCommandActive = false;
                    garudaData.desyncRestartAttempts = 0;
                    garudaData.state = ESC_IDLE;
                    LED2 = 0;
                }
                else if (!garudaData.runCommandActive)
                {
                    /* User pressed stop during coast — graceful idle */
                    garudaData.desyncRestartAttempts = 0;
                    garudaData.state = ESC_IDLE;
                    LED2 = 0;
                }
                else
                {
                    /* Max restarts exhausted — permanent fault */
                    garudaData.runCommandActive = false;
                    garudaData.state = ESC_FAULT;
                    garudaData.faultCode = FAULT_DESYNC;
                    LED2 = 0;
                }
            }
#endif
            break;

        case ESC_FAULT:
            break;
    }

    TIMER1_InterruptFlagClear();
}

#ifdef ENABLE_PWM_FAULT_PCI
/**
 * @brief PWM Fault ISR — handles PCI fault events.
 */
void __attribute__((__interrupt__, no_auto_psv)) _PWMInterrupt(void)
{
    if (PCI_FAULT_ACTIVE_STATUS)
    {
        /* Board-level FPCI fault via PCI8R (RP28/DIM040).
         * Source: U25A (overvoltage) + U25B (overcurrent) → U27 AND gate.
         * This is a combined OC+OV signal — cannot distinguish which triggered. */
#if FEATURE_ADC_CMP_ZC
        if (garudaData.hwzc.enabled)
            HWZC_Disable(&garudaData);
#endif
#if FEATURE_HW_OVERCURRENT
        HAL_CMP3_SetThreshold(RT_OC_CMP3_STARTUP_DAC);
#endif
        HAL_MC1ClearPWMPCIFault();
        HAL_MC1PWMDisableOutputs();
        garudaData.state = ESC_FAULT;
        garudaData.faultCode = FAULT_BOARD_PCI;
        garudaData.runCommandActive = false;
#if FEATURE_ADC_CMP_ZC
        garudaData.hwzc.fallbackPending = false;
#endif
        LED2 = 0;
    }
    ClearPWMIF();
}
#endif /* ENABLE_PWM_FAULT_PCI */

#if FEATURE_ADC_CMP_ZC
/**
 * @brief ADC1 Comparator CH5 ISR — ZC detected on Phase B.
 * Do NOT re-read AD1CH5DATA for validation (Rule 10).
 */
void __attribute__((__interrupt__, no_auto_psv)) _AD1CMP5Interrupt(void)
{
    _AD1CMP5IE = 0;              /* Disable immediately to prevent re-trigger */
    AD1CMPSTATbits.CH5CMP = 0;  /* Clear comparator status */
    if (garudaData.hwzc.enabled)
        HWZC_OnZcDetected(&garudaData);
    _AD1CMP5IF = 0;
}

/**
 * @brief ADC2 Comparator CH1 ISR — ZC detected on Phase A or C.
 */
void __attribute__((__interrupt__, no_auto_psv)) _AD2CMP1Interrupt(void)
{
    _AD2CMP1IE = 0;
    AD2CMPSTATbits.CH1CMP = 0;
    if (garudaData.hwzc.enabled)
        HWZC_OnZcDetected(&garudaData);
    _AD2CMP1IF = 0;
}

/**
 * @brief SCCP1 Timer ISR — blanking expired, commutation deadline, or timeout.
 * Action determined by hwzc.phase (Rule 3: phase is set BEFORE timer starts).
 */
void __attribute__((__interrupt__, no_auto_psv)) _CCT1Interrupt(void)
{
    if (!garudaData.hwzc.enabled)
    {
        /* HWZC was disabled (fault, button stop, throttle-zero shutdown)
         * while a timer event was pending. Discard — do not commutate. */
        _CCT1IF = 0;
        return;
    }

    switch (garudaData.hwzc.phase)
    {
        case HWZC_BLANKING:
            HWZC_OnBlankingExpired(&garudaData);
            break;
        case HWZC_WATCHING:
            HWZC_OnTimeout(&garudaData);
            break;
        case HWZC_COMM_PENDING:
            HWZC_OnCommDeadline(&garudaData);
            break;
        default:
            break;
    }
    _CCT1IF = 0;
}
#endif /* FEATURE_ADC_CMP_ZC */
